cf_billing/InformationRegisters/энргНастройкиРасчетаСреднегоПотребления.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргНастройкиРасчетаСреднегоПотребления</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗаПрошлыйГод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗаПрошлыйГодОбъемПотребленный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПериодов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПериодовОбъемПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоказаний</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПоказанийОбъемПотребленный</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьСреднийОбъемНеБолееМесяцев</Name>
					<Comment>Длительность периода начислений по среднему</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный</Name>
					<Comment>Длительность периода начислений по среднему</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоВсемНачислениям</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоВсемНачислениямОбъемПотребленный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьСезонность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеПрименятьСезонностьПотребленный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеИспользованияТУ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргНаправлениеИспользованияТочекУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/энргНастройкиРасчетаСреднегоПотребления/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет настройку расчета среднего потребления.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура НастройкиРасчетаСреднегоПотребления(Схема,ПараметрыОтбора,ТаблицаДляПомещения = "НастройкиРасчетаСреднегоПотребления")  Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса")); 		
	КонецЕсли;
	
	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкиРасчетаСреднегоПотребления());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
	ОператорВыбора 						= Пакет.Операторы[0];	
	Источник 							= ОператорВыбора.Источники[0].Источник;
	Параметры 							= Источник.Параметры;	
	ПараметрПериод 						= Параметры[0];
	
	Если ПараметрыОтбора.Свойство("Период") И Не ПустаяСтрока(ПараметрыОтбора.Период.ИмяПараметра) Тогда
		ПараметрПериод 				= Параметры[0];
		ПараметрПериод.Выражение 	= Новый ВыражениеСхемыЗапроса("&" + ПараметрыОтбора["Период"].ИмяПараметра);		
	КонецЕсли;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		Отбор 							= ОператорВыбора.Отбор;		
		ДоступныеПараметры 				= "Организация, Район, Услуга, НаправлениеИспользованияТУ";
		энргФормированиеТекстовЗапроса.УстановитьПараметрыВременнойТаблицыРегистраСведений(Параметры[1],ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;
		
КонецПроцедуры

// Заполняет настройку расчета среднего потребления коллекция периодов.
//
// Параметры:
//  Схема				-	СхемаЗапроса.
//  ПараметрыОтбора		-	Структура.
//  ИмяТаблицыПериодов	-	Строка.
//  ТаблицаДляПомещения	-	Строка.
//
Процедура НастройкиРасчетаСреднегоПотребленияКоллекцияПериодов(Схема,ПараметрыОтбора,ИмяТаблицыПериодов,ТаблицаДляПомещения) Экспорт
	
	Если Схема = Неопределено Тогда
		Схема 							= Новый СхемаЗапроса;
		Пакет 							= Схема.ПакетЗапросов[0];
	Иначе
		Пакет 							= Схема.ПакетЗапросов.Добавить(Тип("ЗапросВыбораСхемыЗапроса")); 		
	КонецЕсли;

	Пакет.УстановитьТекстЗапроса(ТекстЗапросаНастройкиРасчетаСреднегоПотребленияКоллекцияПериодов());
	Пакет.ТаблицаДляПомещения 			= ТаблицаДляПомещения;
		
	ОператорВыбора 					= Пакет.Операторы[0].Источники[0].Источник.Запрос.Операторы[0];	
	Источник 						= ОператорВыбора.Источники[0].Источник;
	Параметры 						= Источник.Параметры;
	
	Если ПараметрыОтбора.Свойство("ПараметрыВТ") Тогда
		ДоступныеПараметры 			= "Организация, Район, Услуга, НаправлениеИспользованияТУ";
		ИмяТаблицы 					= "НастройкиРасчетаСреднегоПотребления";
		энргФормированиеТекстовЗапроса.УстановитьОтборТаблицы(ОператорВыбора.Отбор,ИмяТаблицы,ПараметрыОтбора.ПараметрыВТ,ДоступныеПараметры);				
	КонецЕсли;	 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаНастройкиРасчетаСреднегоПотребления()
	
	Текст  = 
	"ВЫБРАТЬ
	|	НастройкиРасчетаСреднегоПотребления.Организация КАК Организация,
	|	НастройкиРасчетаСреднегоПотребления.Район КАК Район,
	|	НастройкиРасчетаСреднегоПотребления.Услуга КАК Услуга,
	|	НастройкиРасчетаСреднегоПотребления.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	НастройкиРасчетаСреднегоПотребления.КоличествоПоказаний КАК КоличествоПоказаний,
	|	НастройкиРасчетаСреднегоПотребления.КоличествоПериодов КАК КоличествоПериодов,
	|	НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|	НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениям КАК ПоВсемНачислениям,
	|	НастройкиРасчетаСреднегоПотребления.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|	НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГодОбъемПотребленный КАК ЗаПрошлыйГодОбъемПотребленный,
	|	НастройкиРасчетаСреднегоПотребления.КоличествоПериодовОбъемПотребленный КАК КоличествоПериодовОбъемПотребленный,
	|	НастройкиРасчетаСреднегоПотребления.КоличествоПоказанийОбъемПотребленный КАК КоличествоПоказанийОбъемПотребленный,
	|	НастройкиРасчетаСреднегоПотребления.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный КАК НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный,
	|	НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениямОбъемПотребленный КАК ПоВсемНачислениямОбъемПотребленный,
	|	НастройкиРасчетаСреднегоПотребления.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкиРасчетаСреднегоПотребления.НеПрименятьСезонностьПотребленный КАК НеПрименятьСезонностьПотребленный
	|ИЗ
	|	РегистрСведений.энргНастройкиРасчетаСреднегоПотребления.СрезПоследних КАК НастройкиРасчетаСреднегоПотребления";
	
	Возврат Текст;
	
КонецФункции

Функция ТекстЗапросаНастройкиРасчетаСреднегоПотребленияКоллекцияПериодов()
	Текст = 
	"ВЫБРАТЬ
	|	ВложенныйЗапрос.ПериодНачисления КАК ПериодНачисления,
	|	НастройкиРасчетаСреднегоПотребления.Организация КАК Организация,
	|	НастройкиРасчетаСреднегоПотребления.Район КАК Район,
	|	НастройкиРасчетаСреднегоПотребления.Услуга КАК Услуга,
	|	НастройкиРасчетаСреднегоПотребления.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|	НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГод КАК ЗаПрошлыйГод,
	|	НастройкиРасчетаСреднегоПотребления.ЗаПрошлыйГодОбъемПотребленный КАК ЗаПрошлыйГодОбъемПотребленный,
	|	НастройкиРасчетаСреднегоПотребления.КоличествоПериодов КАК КоличествоПериодов,
	|	НастройкиРасчетаСреднегоПотребления.КоличествоПериодовОбъемПотребленный КАК КоличествоПериодовОбъемПотребленный,
	|	НастройкиРасчетаСреднегоПотребления.КоличествоПоказаний КАК КоличествоПоказаний,
	|	НастройкиРасчетаСреднегоПотребления.КоличествоПоказанийОбъемПотребленный КАК КоличествоПоказанийОбъемПотребленный,
	|	НастройкиРасчетаСреднегоПотребления.НачислятьСреднийОбъемНеБолееМесяцев КАК НачислятьСреднийОбъемНеБолееМесяцев,
	|	НастройкиРасчетаСреднегоПотребления.НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный КАК НачислятьСреднийОбъемНеБолееМесяцевОбъемПотребленный,
	|	НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениям КАК ПоВсемНачислениям,
	|	НастройкиРасчетаСреднегоПотребления.ПоВсемНачислениямОбъемПотребленный КАК ПоВсемНачислениямОбъемПотребленный,
	|	НастройкиРасчетаСреднегоПотребления.НеПрименятьСезонность КАК НеПрименятьСезонность,
	|	НастройкиРасчетаСреднегоПотребления.НеПрименятьСезонностьПотребленный КАК НеПрименятьСезонностьПотребленный
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаПериодов.ПериодНачисления КАК ПериодНачисления,
	|		НастройкиРасчетаСреднегоПотребления.Организация КАК Организация,
	|		НастройкиРасчетаСреднегоПотребления.Район КАК Район,
	|		НастройкиРасчетаСреднегоПотребления.Услуга КАК Услуга,
	|		НастройкиРасчетаСреднегоПотребления.НаправлениеИспользованияТУ КАК НаправлениеИспользованияТУ,
	|		МАКСИМУМ(НастройкиРасчетаСреднегоПотребления.Период) КАК Период
	|	ИЗ
	|		РегистрСведений.энргНастройкиРасчетаСреднегоПотребления КАК НастройкиРасчетаСреднегоПотребления
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаПериодов КАК ТаблицаПериодов
	|			ПО НастройкиРасчетаСреднегоПотребления.Организация = ТаблицаПериодов.Организация
	|				И НастройкиРасчетаСреднегоПотребления.Район = ТаблицаПериодов.Район
	|				И НастройкиРасчетаСреднегоПотребления.Период < ТаблицаПериодов.ЗавершениеОП
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаПериодов.ПериодНачисления,
	|		НастройкиРасчетаСреднегоПотребления.Организация,
	|		НастройкиРасчетаСреднегоПотребления.Район,
	|		НастройкиРасчетаСреднегоПотребления.Услуга,
	|		НастройкиРасчетаСреднегоПотребления.НаправлениеИспользованияТУ) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.энргНастройкиРасчетаСреднегоПотребления КАК НастройкиРасчетаСреднегоПотребления
	|		ПО ВложенныйЗапрос.Организация = НастройкиРасчетаСреднегоПотребления.Организация
	|			И ВложенныйЗапрос.Район = НастройкиРасчетаСреднегоПотребления.Район
	|			И ВложенныйЗапрос.Услуга = НастройкиРасчетаСреднегоПотребления.Услуга
	|			И ВложенныйЗапрос.НаправлениеИспользованияТУ = НастройкиРасчетаСреднегоПотребления.НаправлениеИспользованияТУ
	|			И ВложенныйЗапрос.Период = НастройкиРасчетаСреднегоПотребления.Период";
	
	Возврат Текст;
	 Возврат Текст;
КонецФункции

#КонецОбласти

#КонецЕсли
